micahjp5158/stm32-projects/stm32f407vg/registers/rtc.h
/*
 * rtc.h
 *
 * Defines macros for STM32F407VG RTC peripheral registers.
 */

#ifndef RTC_H
#define RTC_H

#include "stm32f407vg.h"

/* RTC peripheral base address from STM32F407VG reference manual, Table 1 */
#define RTC_BASE_ADDR   0x40002800U

/* RTC register offsets from STM32F407VG reference manual Table 121 */
#define RTC_TR_OFFEST   	0x00U
#define RTC_DR_OFFEST 		0x04U
#define RTC_CR_OFFSET 		0x08U
#define RTC_ISR_OFFSET  	0x0CU
#define RTC_PRER_OFFSET 	0x10U
#define RTC_WUTR_OFFSET 	0x14U
#define RTC_CALIBR_OFFSET 	0x18U
#define RTC_ALRMAR_OFFSET 	0x1CU
#define RTC_ALRMBR_OFFSET   0x20U
#define RTC_WPR_OFFSET 	    0x24U
#define RTC_SSR_OFFSET 		0x28U
#define RTC_SHIFTR_OFFSET   0x2CU
#define RTC_TSTR_OFFSET     0x30U
#define RTC_TSDR_OFFSET     0x34U
#define RTC_TSSSR_OFFSET 	0x38U
#define RTC_CALR_OFFSET 	0x3CU
#define RTC_TAFCR_OFFSET 	0x40U
#define RTC_ALRMASSR_OFFSET	0x44U
#define RTC_ALRMBSSR_OFFSET	0x48U
#define RTC_BKP0R_OFFSET	0x50U
#define RTC_BKP1R_OFFSET	0x54U
#define RTC_BKP2R_OFFSET	0x58U
#define RTC_BKP3R_OFFSET	0x5CU
#define RTC_BKP4R_OFFSET	0x60U
#define RTC_BKP5R_OFFSET	0x64U
#define RTC_BKP6R_OFFSET	0x68U
#define RTC_BKP7R_OFFSET	0x6CU
#define RTC_BKP8R_OFFSET	0x70U
#define RTC_BKP9R_OFFSET	0x74U
#define RTC_BKP10R_OFFSET	0x78U
#define RTC_BKP11R_OFFSET	0x7CU
#define RTC_BKP12R_OFFSET	0x80U
#define RTC_BKP13R_OFFSET	0x84U
#define RTC_BKP14R_OFFSET	0x88U
#define RTC_BKP15R_OFFSET	0x8CU
#define RTC_BKP16R_OFFSET	0x90U
#define RTC_BKP17R_OFFSET	0x94U
#define RTC_BKP18R_OFFSET	0x98U
#define RTC_BKP19R_OFFSET	0x9CU

/* RTC register address definitions */
#define RTC_TR          (RTC_BASE_ADDR + RTC_TR_OFFEST)         // RTC time register
#define RTC_DR          (RTC_BASE_ADDR + RTC_DR_OFFEST)         // RTC date register
#define RTC_CR          (RTC_BASE_ADDR + RTC_CR_OFFSET)         // RTC control register
#define RTC_ISR         (RTC_BASE_ADDR + RTC_ISR_OFFSET)        // RTC initialization and status register
#define RTC_PRER        (RTC_BASE_ADDR + RTC_PRER_OFFSET)       // RTC prescaler register
#define RTC_WUTR        (RTC_BASE_ADDR + RTC_WUTR_OFFSET)       // RTC wakeup timer register
#define RTC_CALIBR      (RTC_BASE_ADDR + RTC_CALIBR_OFFSET)     // RTC calibration register
#define RTC_ALRMAR      (RTC_BASE_ADDR + RTC_ALRMAR_OFFSET)     // RTC alarm A register
#define RTC_ALRMBR      (RTC_BASE_ADDR + RTC_ALRMBR_OFFSET)     // RTC alarm B register
#define RTC_WPR         (RTC_BASE_ADDR + RTC_WPR_OFFSET)        // RTC write protection register
#define RTC_SSR         (RTC_BASE_ADDR + RTC_SSR_OFFSET)        // RTC subsecond register
#define RTC_SHIFTR      (RTC_BASE_ADDR + RTC_SHIFTR_OFFSET)     // RTC shift control register
#define RTC_TSTR        (RTC_BASE_ADDR + RTC_TSTR_OFFSET)       // RTC time stamp time register
#define RTC_TSDR        (RTC_BASE_ADDR + RTC_TSDR_OFFSET)       // RTC time stamp date register
#define RTC_TSSSR       (RTC_BASE_ADDR + RTC_TSSSR_OFFSET)      // RTC timestamp sub second register
#define RTC_CALR        (RTC_BASE_ADDR + RTC_CALR_OFFSET)       // RTC calibration register
#define RTC_TAFCR       (RTC_BASE_ADDR + RTC_TAFCR_OFFSET)      // RTC tamper and alternate function configuration register
#define RTC_ALRMASSR    (RTC_BASE_ADDR + RTC_ALRMASSR_OFFSET)   // RTC alarm A sub second register
#define RTC_ALRMBSSR    (RTC_BASE_ADDR + RTC_ALRMBSSR_OFFSET)   // RTC alarm B sub second register
#define RTC_BKP0R       (RTC_BASE_ADDR + RTC_BKP0R_OFFSET)      // RTC backup register 0
#define RTC_BKP1R       (RTC_BASE_ADDR + RTC_BKP1R_OFFSET)      // RTC backup register 1
#define RTC_BKP2R       (RTC_BASE_ADDR + RTC_BKP2R_OFFSET)      // RTC backup register 2
#define RTC_BKP3R       (RTC_BASE_ADDR + RTC_BKP3R_OFFSET)      // RTC backup register 3
#define RTC_BKP4R       (RTC_BASE_ADDR + RTC_BKP4R_OFFSET)      // RTC backup register 4
#define RTC_BKP5R       (RTC_BASE_ADDR + RTC_BKP5R_OFFSET)      // RTC backup register 5
#define RTC_BKP6R       (RTC_BASE_ADDR + RTC_BKP6R_OFFSET)      // RTC backup register 6
#define RTC_BKP7R       (RTC_BASE_ADDR + RTC_BKP7R_OFFSET)      // RTC backup register 7
#define RTC_BKP8R       (RTC_BASE_ADDR + RTC_BKP8R_OFFSET)      // RTC backup register 8
#define RTC_BKP9R       (RTC_BASE_ADDR + RTC_BKP9R_OFFSET)      // RTC backup register 9
#define RTC_BKP10R      (RTC_BASE_ADDR + RTC_BKP10R_OFFSET)     // RTC backup register 10
#define RTC_BKP11R      (RTC_BASE_ADDR + RTC_BKP11R_OFFSET)     // RTC backup register 11
#define RTC_BKP12R      (RTC_BASE_ADDR + RTC_BKP12R_OFFSET)     // RTC backup register 12
#define RTC_BKP13R      (RTC_BASE_ADDR + RTC_BKP13R_OFFSET)     // RTC backup register 13
#define RTC_BKP14R      (RTC_BASE_ADDR + RTC_BKP14R_OFFSET)     // RTC backup register 14
#define RTC_BKP15R      (RTC_BASE_ADDR + RTC_BKP15R_OFFSET)     // RTC backup register 15
#define RTC_BKP16R      (RTC_BASE_ADDR + RTC_BKP16R_OFFSET)     // RTC backup register 16
#define RTC_BKP17R      (RTC_BASE_ADDR + RTC_BKP17R_OFFSET)     // RTC backup register 17
#define RTC_BKP18R      (RTC_BASE_ADDR + RTC_BKP18R_OFFSET)     // RTC backup register 18
#define RTC_BKP19R      (RTC_BASE_ADDR + RTC_BKP19R_OFFSET)     // RTC backup register 19

/* RTC_TR bit definitions */
#define RTC_TR_SU_0     BIT0    // Second units in BCD format [0]
#define RTC_TR_SU_1     BIT1    // Second units in BCD format [1]
#define RTC_TR_SU_2     BIT2    // Second units in BCD format [2]
#define RTC_TR_SU_3     BIT3    // Second units in BCD format [3]
#define RTC_TR_ST_0     BIT4    // Second tens in BCD format [0]
#define RTC_TR_ST_1     BIT5    // Second tens in BCD format [1]
#define RTC_TR_ST_2     BIT6    // Second tens in BCD format [2]
#define RTC_TR_MNU_0    BIT8    // Minute units in BCD format [0]
#define RTC_TR_MNU_1    BIT9    // Minute units in BCD format [1]
#define RTC_TR_MNU_2    BIT10   // Minute units in BCD format [2]
#define RTC_TR_MNU_3    BIT11   // Minute units in BCD format [3]
#define RTC_TR_MNT_0    BIT12   // Minute tens in BCD format [0]
#define RTC_TR_MNT_1    BIT13   // Minute tens in BCD format [1]
#define RTC_TR_MNT_2    BIT14   // Minute tens in BCD format [2]
#define RTC_TR_HU_0     BIT16   // Hour units in BCD format [0]
#define RTC_TR_HU_1     BIT17   // Hour units in BCD format [1]
#define RTC_TR_HU_2     BIT18   // Hour units in BCD format [2]
#define RTC_TR_HU_3     BIT19   // Hour units in BCD format [3]
#define RTC_TR_HT_0     BIT20   // Hour tens in BCD format [0]
#define RTC_TR_HT_1     BIT21   // Hour tens in BCD format [1]
#define RTC_TR_PM       BIT22   // AM/PM notation

